Revit 2024 API
ElectricalSystem.NeutralConductorsNumber Property
 The NeutralConductors Number of the Electrical System.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public int NeutralConductorsNumber { get; set; }
Visual Basic
Public Property NeutralConductorsNumber As Integer
	Get
	Set
Visual C++
public:
property int NeutralConductorsNumber {
	int get ();
	void set (int value);
}
Remarks
 This property is used to retrieve the NeutralConductors Number of the Electrical System.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.
Autodesk.Revit.Exceptions.InvalidOperationException |  This property only available when System Type is Power!
See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace